<?php

use Faker\Generator as Faker;

$factory->define(App\Entities\ErrorCode::class, function (Faker $faker) {

    static $index = 0;
    $ErrorInfo = [
        [1, '急停異常','送料機','1'],
        [2, '送料伺服馬達異常','送料機','1'],
        [3, '送料不及','送料機','1'],
        [4, '外部停止','送料機','1'],
        [5, '沖床未送料許可','送料機','1'],
        [6, '末端檢知異常','送料機','1'],
        [7, '模具檢知異常','送料機','1'],
        [8, '料捲變頻器異常','送料機','1'],
        [9, '油壓馬達異常','送料機','1'],
        [10,'壓料輪馬達異常','送料機','1'],
        [1, '急停異常','二次元','1'],
        [2, 'X回原點異常','二次元','1'],
        [3, 'Z1回原點異常','二次元','1'],
        [4, 'Z2回原點異常','二次元','1'],
        [5, '吸盤1吸料異常','二次元','1'],
        [6, '吸盤2吸料異常','二次元','1'],
        [7, 'X伺服馬達異常','二次元','1'],
        [8, 'Z1伺服馬達異常','二次元','1'],
        [9, 'Z2伺服馬達異常','二次元','1'],
        [10,'推垛變頻器異常','二次元','1'],
        [11,'輸送帶馬達異常	','二次元','1'],
        [12,'吸盤1無料異常','二次元','1'],
        [13,'吸盤2無料異常','二次元','1'],
        [14,'沖床上死點異常','二次元','1'],
    ];
    
    return [
        'code' => $ErrorInfo[$index][0],
        'message' => $ErrorInfo[$index][1],
        'machine_type' => $ErrorInfo[$index][2],
        'group' => $ErrorInfo[$index++][3],
    ];
});
